#파이썬으로 구현

우선 랜덤으로 최초의 아이들을 생성한다.

그리고 그 생성된 아이들을 가지고 fitness (성능)을 측정한다.

성능을 측정할 때 적절한 점수를 부여하여 만약 점수가 높다면 해당 아이들을 선발해 낸다.

그리고 선발된 아이들을 교배하여 다음 세대를 만들어낸다.

그 과정에서 돌연변이도 추가하여 다음 세대를 만들어 내고 또 태어난 자식들을 가지고 성능을 측정하여

위의 과정을 계속 반복하여 수 세대를 걸쳐서 답을 도출해 내는 것이 유전 알고리즘이다.



우선 비밀번호는 문자열을 사용하고 길이가 최소 2 ~ 최대 10 정도로 적당하게 설정한다.

그리고 랜덤으로 아스키코드의 문자와 숫자를 생성해야 하기 때문에 random과 string을 import 한다.


-------------------------------------------------------------------------------------------------------------------------
import random
import string
-------------------------------------------------------------------------------------------------------------------------


다음은 비밀번호를 길이만큼 랜덤으로 생성하는 함수이다.

-------------------------------------------------------------------------------------------------------------------------
def generate_word(length):
    result = ""
    x = "".join(random.sample(string.ascii_letters + string.digits, k=length))
    return x
-------------------------------------------------------------------------------------------------------------------------



입력값으로 비밀번호의 length를 받아와서 초기 result 값을 빈 문자열로 초기화 한 뒤에

random을 통해서 a~Z까지 0~9에 해당하는 임의의 아스키 문자와 숫자를 길이만큼 조합하여

x에 저장한 후 해당 비밀번호를 리턴해 준다.
